import { StyleSheet, Text, View } from 'react-native'
import React from 'react'

const PrivacyPolicyPage = () => {
  return (
    <View>
      <Text>Privacy Policy</Text> 
      <Text>شرایط استفاده از اپلیکیشن بازار
با دانلود و استفاده از اپلیکیشن بازار، شما موافقت خود را با شرایط و ضوابط زیر اعلام می‌نمایید:

استفاده از اپلیکیشن:
شما با استفاده از اپلیکیشن بازار موافقت می‌کنید که تنها برای مقاصد قانونی از آن استفاده نمایید. هرگونه سوء استفاده یا نقض قوانین از جمله تبلیغات نادرست، تقلب و یا استفاده از اپلیکیشن به نحوی که منجر به آسیب به سیستم یا دیگر کاربران شود، ممنوع است.

حریم خصوصی:
اطلاعات شخصی شما که در هنگام ثبت‌نام یا استفاده از اپلیکیشن جمع‌آوری می‌شود، تنها برای بهبود خدمات و ارتباط بهتر با شما مورد استفاده قرار خواهد گرفت. اطلاعات شما مطابق با سیاست‌های حریم خصوصی اپلیکیشن بازار محافظت خواهد شد.

محتوا و نمایش محصولات:
اپلیکیشن بازار فقط برای نمایش محصولات و پیشنهادات مختلف به کاربران طراحی شده است. تمامی اطلاعات، تصاویر و توضیحات مربوط به محصولات در اپلیکیشن ممکن است توسط فروشندگان مختلف ارائه شده باشد و مسئولیت صحت آن بر عهده آنها است.

مسئولیت‌های کاربر:
شما مسئول تمامی فعالیت‌هایی هستید که با حساب کاربری خود در اپلیکیشن انجام می‌دهید. مسئولیت هرگونه آسیب یا خسارت ناشی از استفاده نادرست از اپلیکیشن به عهده کاربر خواهد بود.

تغییرات در شرایط:
اپلیکیشن بازار حق دارد در هر زمان شرایط استفاده را تغییر دهد. هرگونه تغییر در شرایط، از طریق اطلاع‌رسانی در اپلیکیشن به شما اعلام خواهد شد و ادامه استفاده شما از اپلیکیشن به منزله پذیرش این تغییرات است.

محدودیت مسئولیت:
اپلیکیشن بازار هیچ‌گونه مسئولیتی در قبال هرگونه مشکلات یا خسارات ناشی از استفاده یا ناتوانی از استفاده از اپلیکیشن نخواهد داشت.

توقف یا تعلیق دسترسی:
اپلیکیشن بازار ممکن است دسترسی شما به اپلیکیشن را در صورت نقض شرایط استفاده یا هرگونه فعالیت غیرقانونی یا خلاف قوانین تعلیق یا مسدود نماید.

این شرایط استفاده به طور کلی به اپلیکیشن "بازار" تعلق دارد و می‌توانید آن را بسته به نیازهای خاص خود تنظیم کنید.</Text>
         
    </View>
  )
}

export default PrivacyPolicyPage;

const styles = StyleSheet.create({})